digit1 = float(input("Первое число: "))
digit2 = float(input("Второе число: "))
digit3 = float(input("Третье число: "))

sum_of_positive = 0

if digit1 > 0:
    sum_of_positive += digit1

if digit2 > 0:
    sum_of_positive += digit2
    
if digit3 > 0:
    sum_of_positive += digit3

print(sum_of_positive) 


# КОММЕНТАРИЙ: что касается учебных задач, то обычно мы подразумеваем, что условный пользователь будет вводить требуемые данные всегда корректно — поэтому проверки на корректность вводимых данных можно не выполнять, пока в задании явным образом не сказано обратное


# Первое число: 5
# Второе число: 63
# Третье число: 2.9
# 70.9

# Первое число: 5
# Второе число: -9
# Третье число: 6
# 11


# ИТОГ: отлично — 4/4
