digit1 = float(input("Первое число: "))
digit2 = float(input("Второе число: "))
digit3 = float(input("Третье число: "))

sum_of_positive = 0

# ИСПРАВИТЬ: две проверки на каждое число избыточны, поскольку в задаче нет требования работать с int объектами — перепишите код так, чтобы проверялось только одно логическое выражение
if digit1 > 0:
    sum_of_positive += digit1
    # ИСПРАВИТЬ: повторное преобразование в объект float лишнее
    
if digit2 > 0:
    sum_of_positive += digit2
    
if digit3 > 0:
    sum_of_positive += digit3

print(sum_of_positive) 


# КОММЕНТАРИЙ: что касается учебных задач, то обычно мы подразумеваем, что условный пользователь будет вводить требуемые данные всегда корректно — поэтому проверки на корректность вводимых данных можно не выполнять, пока в задании явным образом не сказано обратное


# Первое число: 5
# Второе число: 63
# Третье число: 2.9
# 70.9

# Первое число: 5
# Второе число: -9
# Третье число: 6
# 11


# ИТОГ: нужно лучше — 2/4
