digit1 = int(input("Первое число: "))
digit2 = int(input("Второе число: "))

# ИСПРАВИТЬ: это так не работает, вспоминайте приоритеты операторов и читайте карточку Логические выражения
if digit1 and digit2 != 0:
    # СДЕЛАТЬ: подумайте и перепишите нижеследующую часть кода так, чтобы обойтись только одним блоком if
    if digit1 % digit2 == 0:
        print(f"{digit1} делится на {digit2} нацело \n"
              f"частное: {digit1 // digit2}")
    else:
        print(f"{digit1} не делится на {digit2} нацело \n"
              f"неполное частное: {digit1 // digit2} \n"
              # ИСПРАВИТЬ: вы уже вычисляли остаток, а здесь повторно выполняете ту же операцию — неоптимально
              f"остаток: {digit1 % digit2}")
else:
    print("Ни одно из чисел не должно быть равным нулю.")


# 20 делится на 5 нацело
# частное: 4

# 17 не делится на 3 нацело
# неполное частное: 5
# остаток: 2


# ИТОГ: доработать — 1/3
