digit1 = int(input("Первое число: "))
digit2 = int(input("Второе число: "))

result = digit1 % digit2
total = digit1 // digit2

# ИСПРАВИТЬ: это так не работает, вспоминайте приоритеты операторов и читайте карточку Логические выражения

# СДЕЛАТЬ: подумайте и перепишите нижеследующую часть кода так, чтобы обойтись только одним блоком if

# ИСПРАВИТЬ: вы уже вычисляли остаток, а здесь повторно выполняете ту же операцию — неоптимально
answer = (f"{digit1} делится на {digit2} нацело \n"
          f"частное: {total}")

if result:
    answer = (f"{digit1} не делится на {digit2} нацело \n"
              f"неполное частное: {total} \n"
              f"остаток: {result}")
             

print(answer)

# ***Ниже есть супер извращенный вариант***

# output = (f"{digit1} {'не ' if result else ''}делится на {digit2} нацело\n"
          # f"{f'частное: {total}' if not result else ''}\n"
          # f"{'неполное частное: %d' % total if result else ''}\n" 
          # f"{'остаток: %d' % result if result else ''}")

# print(output)


# 20 делится на 5 нацело
# частное: 4

# 17 не делится на 3 нацело
# неполное частное: 5
# остаток: 2


# ИТОГ: доработать — 1/3
