first_cell = input("Укажите первую клетку: ")
second_cell = input("Укажите вторую клетку: ")

first_difference = ord(first_cell[0]) - ord(second_cell[0])
second_difference = int(first_cell[1]) - int(second_cell[1])

# ИСПРАВИТЬ: обычно не стоит выполнять одни и те же вычисления или операции несколько раз — оптимальнее один раз вычислить разность соответствующих компонент координат клеток, а потом анализировать полученные значения
if (-1 <= first_difference <= 1) and (-1 <= second_difference <= 1):
    print("Да")
# ИСПРАВИТЬ: намного удобнее читать подобные логические выражения, если записать их в форме двойного неравенства

else:
    print("Нет")



# Укажите первую клетку: d3
# Укажите вторую клетку: e4
# Да

# Укажите первую клетку: d2
# Укажите вторую клетку: f3
# Нет

# ИТОГ: нужно лучше — 2/4
