first_cell = input("Укажите первую клетку: ")
second_cell = input("Укажите вторую клетку: ")

# ИСПРАВИТЬ: обычно не стоит выполнять одни и те же вычисления или операции несколько раз — оптимальнее один раз вычислить разность соответствующих компонент координат клеток, а потом анализировать полученные значения
if ord(first_cell[0]) - ord(second_cell[0]) < -1 or ord(first_cell[0]) - ord(second_cell[0]) > 1:
    print("Нет")
# ИСПРАВИТЬ: намного удобнее читать подобные логические выражения, если записать их в форме двойного неравенства
elif int(first_cell[1]) - int(second_cell[1]) < -1 or int(first_cell[1]) - int(second_cell[1]) > 1:
    print("Нет")
else:
    print("Да")


# Укажите первую клетку: d3
# Укажите вторую клетку: e4
# Да


# ИТОГ: нужно лучше — 2/4
