from pathlib import Path
import re

from utils import search_files

def search_context(*keywords: str, context: int=0) -> list[dict]:
    """
    Функция осуществляет поиск в текстовых файлах строчек, содержащих ключевые слова.
    
    :param keywords: Строка. Одно или несколько ключевых слов.
    :param context: Целое число. Опциональный аргумент, указывающий на возвращаемое количество строк до и после ключевой.
    
    :return: Список словарей. Значениями являются: количество строк до и после ключевой, имя файла, ключевое слово, номер строчки с ключевым словом, найденная(-ые) строчка(-и).
    """
    directory = Path.cwd() / 'data'
    files = search_files(directory)
    results = []

    for filename, text in files.items():
        for count, line in enumerate(text.split('\n'), start=1):
            found_keywords = []
            for keyword in keywords:
                if re.search(keyword, line, re.IGNORECASE):
                    found_keywords.append(keyword)
            for word in found_keywords:
                result = {
                    'keyword': word,
                    'filename': filename,
                    'line': count,
                    'context': context,
                    'text': ''
                }
                if count == len(text.split('\n')):
                    text_context = '\n'.join(text.split('\n')[count - context - 1:])
                else:
                    text_context = '\n'.join(text.split('\n')[count - context - 1:count + context])
                result['text'] = text_context
                results.append(result)
    return results
    

# >>> from pprint import pprint
# >>>
# >>> pprint(search_context('комната', 'стул'))
# [{'context': 0,
  # 'filename': 'E3ln1.txt',
  # 'keyword': 'стул',
  # 'line': 67,
  # 'text': 'В столовой уже стояли два мальчика, сыновья Манилова, которые были '
          # 'в тех летах, когда сажают уже детей за стол, но еще на высоких '
          # 'стульях. При них стоял учитель, поклонившийся вежливо и с улыбкою. '
          # 'Хозяйка села за свою суповую чашку; гость был посажен между '
          # 'хозяином и хозяйкою, слуга завязал детям на шею салфетки.'},
 # {'context': 0,
  # 'filename': 'E3ln1.txt',
  # 'keyword': 'комната',
  # 'line': 86,
  # 'text': 'Комната была, точно, не без приятности: стены были выкрашены '
          # 'какой-то голубенькой краской вроде серенькой, четыре стула, одно '
          # 'кресло, стол, на котором лежала книжка с заложенною закладкою, о '
          # 'которой мы уже имели случай упомянуть, несколько исписанных бумаг, '
          # 'но больше всего было табаку. Он был в разных видах: в картузах и в '
          # 'табачнице, и, наконец, насыпан был просто кучею на столе. На своих '
          # 'окнах тоже помещены были горки выбитой из трубки золы, '
          # 'расставленные не без старания очень красивыми рядками. Заметно '
          # 'было, что это иногда доставляло хозяину препровождение времени.'},
 # {'context': 0,
  # 'filename': 'E3ln1.txt',
  # 'keyword': 'стул',
  # 'line': 86,
  # 'text': 'Комната была, точно, не без приятности: стены были выкрашены '
          # 'какой-то голубенькой краской вроде серенькой, четыре стула, одно '
          # 'кресло, стол, на котором лежала книжка с заложенною закладкою, о '
          # 'которой мы уже имели случай упомянуть, несколько исписанных бумаг, '
          # 'но больше всего было табаку. Он был в разных видах: в картузах и в '
          # 'табачнице, и, наконец, насыпан был просто кучею на столе. На своих '
          # 'окнах тоже помещены были горки выбитой из трубки золы, '
          # 'расставленные не без старания очень красивыми рядками. Заметно '
          # 'было, что это иногда доставляло хозяину препровождение времени.'},
 # {'context': 0,
  # 'filename': 'E3ln1.txt',
  # 'keyword': 'стул',
  # 'line': 88,
  # 'text': ' - Позвольте, я сяду на стуле.'},
 # {'context': 0,
  # 'filename': 'E3ln1.txt',
  # 'keyword': 'стул',
  # 'line': 163,
  # 'text': 'Манилов долго стоял на крыльце, провожая глазами удалявшуюся '
          # 'бричку, и когда она уже совершенно стала не видна, он все еще '
          # 'стоял, куря трубку. Наконец вошел он в комнату, сел на стуле и '
          # 'предался размышлению, душевно радуясь, что доставил гостю своему '
          # 'небольшое удовольствие. Потом мысли его перенеслись незаметно к '
          # 'другим предметам и наконец занеслись бог знает куда. Он думал о '
          # 'благополучии дружеской жизни, о том, как бы хорошо было жить с '
          # 'другом на берегу какой-нибудь реки, потом чрез эту реку начал '
          # 'строиться у него мост, потом огромнейший дом с таким высоким '
          # 'бельведером, что можно оттуда видеть даже Москву, и там пить '
          # 'вечером чай на открытом воздухе и рассуждать о каких-нибудь '
          # 'приятных предметах. Потом, что они вместе с Чичиковым приехали в '
          # 'какое-то общество в хороших каретах, где обворожают всех '
          # 'приятностию обращения, и что будто бы государь, узнавши о такой их '
          # 'дружбе, пожаловал их генералами, и далее, наконец, бог знает что '
          # 'такое, чего уже он и сам никак не мог разобрать. Странная просьба '
          # 'Чичикова прервала вдруг все его мечтания. Мысль о ней как-то '
          # 'особенно не варилась в его голове: как ни переворачивал он ее, но '
          # 'никак не мог изъяснить себе, и все время сидел он и курил трубку, '
          # 'что тянулось до самого ужина.'},
 # {'context': 0,
  # 'filename': 'le1UO.txt',
  # 'keyword': 'комната',
  # 'line': 11,
  # 'text': 'Время шло медленно. Все было тихо. В гостиной пробило двенадцать; '
          # 'по всем комнатам часы одни за другими прозвонили двенадцать, - все '
          # 'умолкло опять. Германн стоял, прислонясь к холодной печке. Он был '
          # 'спокоен; сердце его билось ровно, как у человека, решившегося на '
          # 'что-нибудь опасное, но необходимое. Часы пробили первый и второй '
          # 'час утра, - и он услышал дальний стук кареты. Невольное волнение '
          # 'овладело им. Карета подъехала и остановилась. Он услышал стук '
          # 'опускаемой подножки. В доме засуетились. Люди побежали, раздались '
          # 'голоса, и дом осветился. В спальню вбежали три старые горничные, и '
          # 'графиня, чуть живая, вошла и опустилась в вольтеровы кресла. '
          # 'Германн глядел в щелку: Лизавета Ивановна прошла мимо его. Германн '
          # 'услышал ее торопливые шаги по ступеням ее лестницы. В сердце его '
          # 'отозвалось нечто похожее на угрызение совести и снова умолкло. Он '
          # 'окаменел.'},
 # {'context': 0,
  # 'filename': 'le1UO.txt',
  # 'keyword': 'комната',
  # 'line': 13,
  # 'text': 'Как и все старые люди вообще, графиня страдала бессонницею. '
          # 'Раздевшись, она села у окна в вольтеровы кресла и отослала '
          # 'горничных. Свечи вынесли, комната опять осветилась одною лампадою. '
          # 'Графиня сидела вся желтая, шевеля отвислыми губами, качаясь направо '
          # 'и налево. В мутных глазах ее изображалось совершенное отсутствие '
          # 'мысли; смотря на нее, можно было бы подумать, что качание страшной '
          # 'старухи происходило не от ее воли, но по действию скрытого '
          # 'гальванизма.'}]
          
          
# >>> pprint(search_context('стул', context=2))
# [{'context': 2,
  # 'filename': 'E3ln1.txt',
  # 'keyword': 'стул',
  # 'line': 67,
  # 'text': ' - Прошу покорнейше, - сказал Манилов. - Вы извините, если у нас '
          # 'нет такого обеда, какой на паркетах и в столицах, у нас просто, по '
          # 'русскому обычаю, щи, но от чистого сердца. Покорнейше прошу.\n'
          # 'Тут они еще несколько времени поспорили о том, кому первому войти, '
          # 'и наконец Чичиков вошел боком в столовую.\n'
          # 'В столовой уже стояли два мальчика, сыновья Манилова, которые были '
          # 'в тех летах, когда сажают уже детей за стол, но еще на высоких '
          # 'стульях. При них стоял учитель, поклонившийся вежливо и с улыбкою. '
          # 'Хозяйка села за свою суповую чашку; гость был посажен между '
          # 'хозяином и хозяйкою, слуга завязал детям на шею салфетки.\n'
          # ' - Какие миленькие дети, - сказал Чичиков, посмотрев на них, - а '
          # 'который год?\n'
          # ' - Старшему осьмой, а меньшему вчера только минуло шесть, - сказала '
          # 'Манилова.'},
 # {'context': 2,
  # 'filename': 'E3ln1.txt',
  # 'keyword': 'стул',
  # 'line': 86,
  # 'text': ' - В таком случае позвольте мне вас попросить в мой кабинет, - '
          # 'сказал Манилов и повел в небольшую комнату, обращенную окном на '
          # 'синевший лес. - Вот мой уголок, - сказал Манилов.\n'
          # ' - Приятная комнатка, - сказал Чичиков, окинувши ее глазами.\n'
          # 'Комната была, точно, не без приятности: стены были выкрашены '
          # 'какой-то голубенькой краской вроде серенькой, четыре стула, одно '
          # 'кресло, стол, на котором лежала книжка с заложенною закладкою, о '
          # 'которой мы уже имели случай упомянуть, несколько исписанных бумаг, '
          # 'но больше всего было табаку. Он был в разных видах: в картузах и в '
          # 'табачнице, и, наконец, насыпан был просто кучею на столе. На своих '
          # 'окнах тоже помещены были горки выбитой из трубки золы, '
          # 'расставленные не без старания очень красивыми рядками. Заметно '
          # 'было, что это иногда доставляло хозяину препровождение времени.\n'
          # ' - Позвольте вас попросить расположиться в этих креслах, - сказал '
          # 'Манилов. - Здесь вам будет попокойнее.\n'
          # ' - Позвольте, я сяду на стуле.'},
 # {'context': 2,
  # 'filename': 'E3ln1.txt',
  # 'keyword': 'стул',
  # 'line': 88,
  # 'text': 'Комната была, точно, не без приятности: стены были выкрашены '
          # 'какой-то голубенькой краской вроде серенькой, четыре стула, одно '
          # 'кресло, стол, на котором лежала книжка с заложенною закладкою, о '
          # 'которой мы уже имели случай упомянуть, несколько исписанных бумаг, '
          # 'но больше всего было табаку. Он был в разных видах: в картузах и в '
          # 'табачнице, и, наконец, насыпан был просто кучею на столе. На своих '
          # 'окнах тоже помещены были горки выбитой из трубки золы, '
          # 'расставленные не без старания очень красивыми рядками. Заметно '
          # 'было, что это иногда доставляло хозяину препровождение времени.\n'
          # ' - Позвольте вас попросить расположиться в этих креслах, - сказал '
          # 'Манилов. - Здесь вам будет попокойнее.\n'
          # ' - Позвольте, я сяду на стуле.\n'
          # ' - Позвольте вам этого не позволить, - сказал Манилов с улыбкою. - '
          # 'Это кресло у меня уж ассигновано для гостя: ради или не ради, но '
          # 'должны сесть.\n'
          # 'Чичиков сел.'},
 # {'context': 2,
  # 'filename': 'E3ln1.txt',
  # 'keyword': 'стул',
  # 'line': 163,
  # 'text': 'Тут Манилов с такою же любезностью рассказал дело кучеру и сказал '
          # 'ему даже один раз «вы».\n'
          # 'Кучер, услышав, что нужно пропустить два поворота и поворотить на '
          # 'третий, сказал: «Потрафим, ваше благородие», - и Чичиков уехал, '
          # 'сопровождаемый долго поклонами и маханьями платка приподымавшихся '
          # 'на цыпочках хозяев.\n'
          # 'Манилов долго стоял на крыльце, провожая глазами удалявшуюся '
          # 'бричку, и когда она уже совершенно стала не видна, он все еще '
          # 'стоял, куря трубку. Наконец вошел он в комнату, сел на стуле и '
          # 'предался размышлению, душевно радуясь, что доставил гостю своему '
          # 'небольшое удовольствие. Потом мысли его перенеслись незаметно к '
          # 'другим предметам и наконец занеслись бог знает куда. Он думал о '
          # 'благополучии дружеской жизни, о том, как бы хорошо было жить с '
          # 'другом на берегу какой-нибудь реки, потом чрез эту реку начал '
          # 'строиться у него мост, потом огромнейший дом с таким высоким '
          # 'бельведером, что можно оттуда видеть даже Москву, и там пить '
          # 'вечером чай на открытом воздухе и рассуждать о каких-нибудь '
          # 'приятных предметах. Потом, что они вместе с Чичиковым приехали в '
          # 'какое-то общество в хороших каретах, где обворожают всех '
          # 'приятностию обращения, и что будто бы государь, узнавши о такой их '
          # 'дружбе, пожаловал их генералами, и далее, наконец, бог знает что '
          # 'такое, чего уже он и сам никак не мог разобрать. Странная просьба '
          # 'Чичикова прервала вдруг все его мечтания. Мысль о ней как-то '
          # 'особенно не варилась в его голове: как ни переворачивал он ее, но '
          # 'никак не мог изъяснить себе, и все время сидел он и курил трубку, '
          # 'что тянулось до самого ужина.'}]