amount = []
while True:
    digit = int(input("Введите целое число: "))
    if digit % 7 != 0:
        # КОММЕНТАРИЙ: в более сложных циклах тело цикла будет более длинным и сложным для восприятия, поэтому лучшей практикой будет вывести действия, выполняемые по завершении цикла, за пределы тела цикла
        print(*amount[::-1])
        break
    amount.append(digit)


# Введите целое число: 7
# Введите целое число: 14
# Введите целое число: 21
# Введите целое число: 23
# 21 14 7


# ИТОГ: отлично — 3/3
