count = int(input("Укажите количество целых чисел: "))

sum_of_positive = 0

while count != 0:
    digit = int(input("Введите целое число: "))
    if digit > 0: 
        sum_of_positive += digit
    count -= 1

print(sum_of_positive)

# Укажите количество целых чисел: 6
# Введите целое число: 3
# Введите целое число: 6
# Введите целое число: -9
# Введите целое число: -9
# Введите целое число: 1
# Введите целое число: 2
# 12


# ИТОГ: отлично — 3/3
