text = input("Введите текст: ")

# строка, потому что прочитал, что, если последовательность небольшая, то логичнее использовать строку
# и итерироваться будет быстрее, чем по списку
symbols = ".,:;!?–—\'\"()*/"

edited_text = ''.join([sym for sym in text if sym not in symbols])

print(edited_text)

# Введите текст: Каир представляет из себя маленький Париж, очень красивый и изящный город, с широкими тротуарами, площадями, обсаженными пальмами. Жить зимой в нем очень приятно: днем температура 16 градусов тепла, ночи холодные, вечное почти солнце, дожди бывают очень редко, а потому дома строятся с плоскими крышами.

# Каир представляет из себя маленький Париж очень красивый и изящный город с широкими тротуарами площадями обсаженными пальмами Жить зимой в нем очень приятно днем температура 16 градусов тепла ночи холодные вечное почти солнце дожди бывают очень редко а потому дома строятся с плоскими крышами