# строка, потому что прочитал, что, если последовательность небольшая, то логичнее использовать строку
# и итерироваться будет быстрее, чем по списку
# КОММЕНТАРИЙ: правильно, потому-то я вам строку и предоставил
punctuation = ".,:;!?–—\'\"()*/"

text = input("Введите текст: ")

# ИСПОЛЬЗОВАТЬ: можно не создавать список, если вы не собираетесь его использовать в таком качестве (а здесь вы этого не делаете) — метод join() ожидает итерируемый объект и прекрасно удовлетворится самим генераторным выражением
edited_text = ''.join(char for char in text if char not in punctuation)

print(edited_text)


# Введите текст: Каир представляет из себя маленький Париж, очень красивый и изящный город, с широкими тротуарами, площадями, обсаженными пальмами. Жить зимой в нем очень приятно: днем температура 16 градусов тепла, ночи холодные, вечное почти солнце, дожди бывают очень редко, а потому дома строятся с плоскими крышами.

# Каир представляет из себя маленький Париж очень красивый и изящный город с широкими тротуарами площадями обсаженными пальмами Жить зимой в нем очень приятно днем температура 16 градусов тепла ночи холодные вечное почти солнце дожди бывают очень редко а потому дома строятся с плоскими крышами


# ИТОГ: отлично — 3/3
