text = input("Введите текст: ")

# строка, потому что прочитал, что, если последовательность небольшая, то логичнее использовать строку
# и итерироваться будет быстрее, чем по списку
symbols = """.,:;!?–—\'\"()*/"""

edited_text = ''.join([sym for sym in text if sym not in symbols])

print(edited_text)

# Введите текст: Варенька, такая милая, добродушная и отзывчивая девушка, глаза которой всегда лучились добротой и теплом, с невозмутимым видом сущего демона шла к бару «Гадкий Гарри» с автоматом Томпсона наперевес, готовая укатать в асфальт этих мерзких, грязных, вонючих и скользких типов, посмевших пялиться на ее прелести и пускать похотливые слюни.

# Варенька такая милая добродушная и отзывчивая девушка глаза которой всегда лучились добротой и теплом с невозмутимым видом сущего демона шла к бару «Гадкий Гарри» с автоматом Томпсона наперевес готовая укатать в асфальт этих мерзких грязных вонючих и скользких типов посмевших пялиться на ее прелести и пускать похотливые слюни
