email = input("Введите адрес электронной почты: ")

# так же добавил проверку, что первый символ не должен быть @
if (
    # ИСПРАВИТЬ: много лишних похожих действий выполняете: например, если метод find() для некоторой подстроки возвращает значение > -1, то это означает, что подстрока найдена — а это в свою очередь означает что количество вхождений этой же подстроки в исходную > 0, верно? так нужно ли отдельное выполнение метода count()?
    #  оптимизируйте
        email.count("@") == 1
    and email[0] != "@"
    and email.count(".") > 0
    and email.rfind(".") > email.find("@") + 1
):
    print("да")
else:
    print("нет")


# Введите адрес электронной почты: exam@mail.ru
# да

# Введите адрес электронной почты: exam.exam@mail
# нет


# ИТОГ: хорошо, но можно лучше — 2/3
