first_list = input("Введите список чисел: ").split()
# ОТВЕТИТЬ: списко — тоже метка в коде?)
second_list = input("Введите второй списко чисел: ").split()

# ИСПРАВИТЬ: если длина первого списка равна нулю, то приложение вываливается с ошибкой (см. пример ниже)
for i in range(len(first_list)):
    # ИСПРАВИТЬ: неоптимально на каждой итерации заново вычислять длину списка, про который точно известно, что его длина не изменится в ходе работы этого цикла
    if second_list == first_list[i:i+len(second_list)]:
        answer = "Да"
        break
    # ИСПРАВИТЬ: лучше блок else отнести к циклу, тогда присваивание будет производиться один раз, а не на каждой итерации после проваленной проверки
    else:
        answer = "Нет"

print(answer)

# ОТВЕТИТЬ: а какие ещё возможны способы решения этой задачи?


# Введите список чисел: 1 2 3 5 8
# Введите второй списко чисел: 2 5
# нет

# Введите список чисел: 1 2 3 5 8
# Введите второй списко чисел: 5 8
# да

# Введите список чисел: 1 2 3 5 8
# Введите второй списко чисел:
# да

# КОММЕНТАРИЙ: нельзя допускать обращений к необъявленной переменной
# Введите список чисел:
# Введите второй списко чисел: 1 2 3
# NameError: name 'answer' is not defined


# ИТОГ: хорошо, но нужно лучше — 2/4
