def deck() -> 'generator':
    """
    Функция - генератор колоды карт.
    
    :return: Объект генератора в виде кортежа (номинал, масть)
    """
    rating = [i for i in range(2, 15)]
    deck_of_cards = ['черви', 'бубны', 'пики', 'трефы']
    
    for card in deck_of_cards:
        for rate in rating:
            yield rate, card


# >>> list(deck())[::13]
# [(2, 'черви'), (2, 'бубны'), (2, 'пики'), (2, 'трефы')]

# >>> list(deck())[::10]
# [(2, 'черви'), (12, 'черви'), (9, 'бубны'), (6, 'пики'), (3, 'трефы'), (13, 'трефы')]

# >>> list(deck())
# [(2, 'черви'), (3, 'черви'), (4, 'черви'), (5, 'черви'), (6, 'черви'), (7, 'черви'), (8, 'черви'), (9, 'черви'), (10, 'черви'), (11, 'черви'), (12, 'черви'), (13, 'черви'), (14, 'черви'), (2, 'бубны'), (3, 'бубны'), (4, 'бубны'), (5, 'бубны'), (6, 'бубны'), (7, 'бубны'), (8, 'бубны'), (9, 'бубны'), (10, 'бубны'), (11, 'бубны'), (12, 'бубны'), (13, 'бубны'), (14, 'бубны'), (2, 'пики'), (3, 'пики'), (4, 'пики'), (5, 'пики'), (6, 'пики'), (7, 'пики'), (8, 'пики'), (9, 'пики'), (10, 'пики'), (11, 'пики'), (12, 'пики'), (13, 'пики'), (14, 'пики'), (2, 'трефы'), (3, 'трефы'), (4, 'трефы'), (5, 'трефы'), (6, 'трефы'), (7, 'трефы'), (8, 'трефы'), (9, 'трефы'), (10, 'трефы'), (11, 'трефы'), (12, 'трефы'), (13, 'трефы'), (14, 'трефы')]


# ИТОГ очень хорошо — 3/3
